In [1]:
#imports the MySQL Connector Python module
import mysql.connector
from mysql.connector import Error

In [5]:
#Connect to the database
try:
    conn=mysql.connector.connect(host='127.0.0.1',
                                database='Company',
                                user='root',
                                password='Th@nkuL0rd')
    if conn.is_connected():
        db_info=conn.get_server_info()
        print("Connected successfully to MySQL Server Version", db_info)
    
except Error as e:
    print("Error while connecting to MySQL", e)

Connected successfully to MySQL Server Version 8.0.24

In [6]:
#Create a cursor to execute SQL querries
cur=conn.cursor()

In [8]:
#Create table Employee
sqlstr="""CREATE TABLE Employee (
Employee_ID int, First_Name varchar(250), Last_Name varchar(250), Email varchar(250), Phone_Number varchar(12), 
Hire_Date date, Job_ID int, Salary float, Manager_ID int, Department_ID int)"""
    
cur.execute(sqlstr)
print("Table created successfully")

Table created successfully

In [9]:
#Create table Departments
sqlstr="""CREATE TABLE Departments(
Department_ID varchar(10), Department_Name varchar(50), Location_ID varchar(10)
)"""

cur.execute(sqlstr)
print("Table created successfully")

Table created successfully

In [10]:
#Create table Jobs
sqlstr="""CREATE TABLE Jobs(
Job_ID varchar(10), Job_Title varchar(250), Min_Salary float, Max_Salary float
)"""

cur.execute(sqlstr)
print("Table create successfully")

Table create successfully

In [21]:
#Insert multiple records into the table Employees
Employee_List=[
    (1, 'John', 'Muraya', 'johnmuraya@gmail.com', '0711111111', '2000-01-01', 1, 256000, 3, 1),
    (2, 'Elvis', 'Sango', 'sangoelvis23@yahoo.com', '0712111112', '2001-01-02', 10, 75000, 3, 4),
    (3, 'Torome', 'Tiriki', 'torome45@yahoo.co.uk', '0713111113', '2000-07-03', 6, 120000, 3, 3),
    (4, 'George', 'Saitoti', 'saisaitot@gmail.com', '0714111114', '2004-03-04', 8, 60000, 3, 2),
    (5, 'Denice', 'Okello', 'OkelloD@yahoo.co.uk', '0715111115', '2005-01-05', 5, 120000, 3, 5),
    (6, 'Dolphine', 'Kemmy', 'kemmy@hotmail.com', '0716111116', '2000-02-06', 2, 235000, 3, 1),
    (7, 'Sue', 'Gacheri', 'gacheriSue@gmail.com', '0717111117', '2003-01-07', 9, 60000, 3, 5),
    (8, 'Bob', 'Morgan', 'bobmorgan@yahoo.com', '0718111118', '2004-02-08', 4, 230000, 3, 3),
    (9, 'Lucy', 'Khadija', 'lucylucy@gmail.com', '0719111119', '2004-03-09',3, 250000, 3, 5),
    (10, 'Betty', 'Kyalo', 'kyalobetty@gmail.com', '072111120', '2003-01-10', 7, 73000, 3, 1)
]

cur.executemany("INSERT INTO Employee VALUES(%s,%s,%s,%s,%s,%s,%s,%s,%s,%s)", Employee_List)
conn.commit
print("Records saved successfully")

Records saved successfully

In [19]:
#Create the departments list
Department_List=[
    (1, 'Administration', 10),
    (2, 'Credit', 10),
    (3, 'ICT', 10),
    (4, 'Business Development', 20),
    (5, 'Operations', 20)    
]

cur.executemany("INSERT INTO Departments VALUES(%s,%s,%s)", Department_List)
conn.commit
print("Records saved successfully")

Records saved successfully

In [18]:
#Create the jobs
Jobs_List=[
    (1, 'CEO', 250000, 300000),
    (2, 'Finance Manager', 230000, 250000),
    (3, 'Operations Manager', 200000, 250000),
    (4, 'ICT Manager', 200000, 250000),
    (5, 'Operations Officer', 100000,150000),
    (6, 'ICT Officer', 100000, 150000),
    (7, 'Receptionist', 70000, 100000),
    (8, 'Credit Officer', 50000, 80000),
    (9, 'Teller', 40000, 80000),
    (10, 'Business Development Officer', 50000, 80000)
]

cur.executemany("INSERT INTO Jobs VALUES(%s,%s,%s,%s)", Jobs_List)
conn.commit
print("Records saved")

Records saved

In [26]:
#Display contents of the Employee table
sqlstr="SELECT * FROM Employee"

cur.execute (sqlstr)
result=cur.fetchall()
for row in result:
    print (row)

(1, 'John', 'Muraya', 'johnmuraya@gmail.com', '0711111111', datetime.date(2000, 1, 1), 1, 256000.0, 3, 1)
(2, 'Elvis', 'Sango', 'sangoelvis23@yahoo.com', '0712111112', datetime.date(2001, 1, 2), 10, 75000.0, 3, 4)
(3, 'Torome', 'Tiriki', 'torome45@yahoo.co.uk', '0713111113', datetime.date(2000, 7, 3), 6, 120000.0, 3, 3)
(4, 'George', 'Saitoti', 'saisaitot@gmail.com', '0714111114', datetime.date(2004, 3, 4), 8, 60000.0, 3, 2)
(5, 'Denice', 'Okello', 'OkelloD@yahoo.co.uk', '0715111115', datetime.date(2005, 1, 5), 5, 120000.0, 3, 5)
(6, 'Dolphine', 'Kemmy', 'kemmy@hotmail.com', '0716111116', datetime.date(2000, 2, 6), 2, 235000.0, 3, 1)
(7, 'Sue', 'Gacheri', 'gacheriSue@gmail.com', '0717111117', datetime.date(2003, 1, 7), 9, 60000.0, 3, 5)
(8, 'Bob', 'Morgan', 'bobmorgan@yahoo.com', '0718111118', datetime.date(2004, 2, 8), 4, 230000.0, 3, 3)
(9, 'Lucy', 'Khadija', 'lucylucy@gmail.com', '0719111119', datetime.date(2004, 3, 9), 3, 250000.0, 3, 5)
(10, 'Betty', 'Kyalo', 'kyalobetty@gmail.com', '072111120', datetime.date(2003, 1, 10), 7, 73000.0, 3, 1)

In [27]:
#Display the contents of the Department table
sqlstr="SELECT * FROM Departments"
cur.execute(sqlstr)
result=cur.fetchall()
for row in result:
    print(row)

('1', 'Administration', '10')
('2', 'Credit', '10')
('3', 'ICT', '10')
('4', 'Business Development', '20')
('5', 'Operations', '20')

In [28]:
sqlstr="SELECT * FROM Jobs"

cur.execute(sqlstr)
result=cur.fetchall()
for row in result:
    print(row)

('1', 'CEO', 250000.0, 300000.0)
('2', 'Finance Manager', 230000.0, 250000.0)
('3', 'Operations Manager', 200000.0, 250000.0)
('4', 'ICT Manager', 200000.0, 250000.0)
('5', 'Operations Officer', 100000.0, 150000.0)
('6', 'ICT Officer', 100000.0, 150000.0)
('7', 'Receptionist', 70000.0, 100000.0)
('8', 'Credit Officer', 50000.0, 80000.0)
('9', 'Teller', 40000.0, 80000.0)
('10', 'Business Development Officer', 50000.0, 80000.0)

In [24]:
#Display the contents of all the 3 tables
sqlstr="SELECT * FROM Employee INNER JOIN Departments ON Departments.Department_ID = Employee.Department_ID INNER JOIN Jobs ON Jobs.Job_ID =Employee.Job_ID"

cur.execute(sqlstr)
result=cur.fetchall()
for row in result:
    print(row)

(1, 'John', 'Muraya', 'johnmuraya@gmail.com', '0711111111', datetime.date(2000, 1, 1), 1, 256000.0, 3, 1, '1', 'Administration', '10', '1', 'CEO', 250000.0, 300000.0)
(6, 'Dolphine', 'Kemmy', 'kemmy@hotmail.com', '0716111116', datetime.date(2000, 2, 6), 2, 235000.0, 3, 1, '1', 'Administration', '10', '2', 'Finance Manager', 230000.0, 250000.0)
(9, 'Lucy', 'Khadija', 'lucylucy@gmail.com', '0719111119', datetime.date(2004, 3, 9), 3, 250000.0, 3, 5, '5', 'Operations', '20', '3', 'Operations Manager', 200000.0, 250000.0)
(8, 'Bob', 'Morgan', 'bobmorgan@yahoo.com', '0718111118', datetime.date(2004, 2, 8), 4, 230000.0, 3, 3, '3', 'ICT', '10', '4', 'ICT Manager', 200000.0, 250000.0)
(5, 'Denice', 'Okello', 'OkelloD@yahoo.co.uk', '0715111115', datetime.date(2005, 1, 5), 5, 120000.0, 3, 5, '5', 'Operations', '20', '5', 'Operations Officer', 100000.0, 150000.0)
(3, 'Torome', 'Tiriki', 'torome45@yahoo.co.uk', '0713111113', datetime.date(2000, 7, 3), 6, 120000.0, 3, 3, '3', 'ICT', '10', '6', 'ICT Officer', 100000.0, 150000.0)
(10, 'Betty', 'Kyalo', 'kyalobetty@gmail.com', '072111120', datetime.date(2003, 1, 10), 7, 73000.0, 3, 1, '1', 'Administration', '10', '7', 'Receptionist', 70000.0, 100000.0)
(4, 'George', 'Saitoti', 'saisaitot@gmail.com', '0714111114', datetime.date(2004, 3, 4), 8, 60000.0, 3, 2, '2', 'Credit', '10', '8', 'Credit Officer', 50000.0, 80000.0)
(7, 'Sue', 'Gacheri', 'gacheriSue@gmail.com', '0717111117', datetime.date(2003, 1, 7), 9, 60000.0, 3, 5, '5', 'Operations', '20', '9', 'Teller', 40000.0, 80000.0)
(2, 'Elvis', 'Sango', 'sangoelvis23@yahoo.com', '0712111112', datetime.date(2001, 1, 2), 10, 75000.0, 3, 4, '4', 'Business Development', '20', '10', 'Business Development Officer', 50000.0, 80000.0)

In [30]:
#update the Employee table
New_Emp_List=[
    (91, 'Annabel','Nganga','annabel_nganga@yahoo.com', '0722101010', '2004-05-23', 9, 65000, 1, 5),
    (92, 'Esther','Wambui', 'esther.wambui@gmail.com', '0723101010', '2005-07-19', 10, 70000, 2, 4),
    (94, 'Migot', 'Ndede', 'migot-ndede@hotmail.com', '0724101110', '2003-10-10', 8, 68000, 2, 2)
]

cur.executemany("INSERT INTO Employee VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)", New_Emp_List)
conn.commit
print("Record saved successfully")

Record saved successfully

In [37]:
#Alter the table Employee
sqlstr="ALTER TABLE Employee ADD Cellphone varchar(12), ADD Physical_Address varchar(250);"

cur.execute(sqlstr)
print("Table structure altered successfully")

Table structure altered successfully

In [39]:
#Editing a record
sqlstr="UPDATE Employee SET First_Name= 'George' WHERE Employee_ID=94"

cur.execute(sqlstr)
conn.commit()
print("Record updated successfully")

Record updated successfully

In [40]:
#Review the updated record
sqlstr="SELECT * FROM Employee WHERE Employee_ID=94"

cur.execute(sqlstr)
result=cur.fetchall()
for row in result:
    print(row)

(94, 'George', 'Ndede', 'migot-ndede@hotmail.com', '0724101110', datetime.date(2003, 10, 10), 8, 68000.0, 2, 2, None, None)

In [41]:
#Delete record from the table employee
sqlstr="DELETE FROM Employee WHERE Employee_ID=94"

cur.execute(sqlstr)
conn.commit()
print("Record deleted successfully")

Record deleted successfully